DeviceProcessEvents
| extend parent_proc=tostring(split(ParentImage, "\\")[-1]), extend child_proc=tostring(split(Image, "\\")[-1])
| where parent_proc in~ ("winword.exe", "pwrpnt.exe", "excel") and child_proc in~ ("powershell.exe", "wscript.exe", "cscript.exe", "cmd.exe")
| project Timestamp, Computer, User, parent_proc, child_proc, CommandLine